import asyncio
from datetime import datetime, timedelta

from pyrogram import filters
from pyrogram.errors import FloodWait
from pyrogram.raw import types
from Almortagel import app
import random

chat = []


@app.on_message(filters.group, group = 768)
async def salahr(c, msg):
  if msg.text == "تفعيل الصلى علي النبي":
    if msg.chat.id in chat:
      return await msg.reply_text("- الصلى علي النبي متقعله من قبل")
    else:
      chat.append(msg.chat.id)
      return await msg.reply_text("تم تفعيل الصلى علي النبي")
  elif msg.text == "تعطيل الصلى علي النبي":
    if msg.chat.id in chat:
      chat.remove(msg.chat.id)
      return await msg.reply_text("تم تعطيل الصلى علي النبي")
    else:
      return await msg.reply_text("- الصلى علي النبي متعطله من قبل")
      


async def salah():
   salah = [
    'كالغيثِ ذكرُكَ يا حبيبي لمْ يزلْ يسقي القلوبَ محبَّةً ونعيمَا - يا سيدَ الثقلينِ حُزتَ مكانةً ومقامَ عزٍّ في النفوسِ عظيمَا - يا مَنْ سلكتُمْ نهجهُ وسبيلهُ٠ "صلُّوا عليهِ وسلِّمُوا تسليمَا"  🌿❤',
'أكثروا من الصّلاة على النّبي فإنّها مفتاح لكلّ المغاليق ✨🌷
#اللهم_صل_على_محمد_وال_محمد',
'صلوا على من أضاء الكون نورًا ﷺ 🤍',
'اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد 🦋🌸',
'صلوات ربي وسلامه عليك ي حبيبي ي رسول الله عدد ما ذكره وذكرك الذاكرون وعدد من غفل عن ذكره وذكرك الغافلون 🍀💐',
'إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا (٥٦)سورة الأحزاب 🍀🤍',
'(لا تجعلوا بيوتَكُم قبورًا، ولا تجعلوا قَبري عيدًا، وصلُّوا عليَّ فإنَّ صلاتَكُم تبلغُني حَيثُ كنتُمْ). ',
'(رَغِمَ أنْفُ رَجلٍ ذُكِرتُ عِندَه، فلَمْ يُصلِّ عليَّ، ورَغِمَ أنفُ رجلٍ دخل عليه رمضانُ، ثُم انْسَلَخَ قبلَ أن يُغفرَ لهُ، ورَغِمَ أنْفُ رجلٍ أدركَ عِندَه أبواهُ الكبَرُ فلم يُدْخِلاهُ الجنةَ)',
'(إِنَّ اللَّـهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا). ',
'اللهم صلّ على النبي المُختار الذي أرسلته هاديًا، ومبشّرًا، ونذيرًا، وداعيًا إلى الله بإذنه، وسراجًا منيرًا.',
'اللهم صلّ على المصطفى الذي اصطفيته؛ ليكون خاتمًا للأنبياء والمرسلين.',
'اللهم صلّ على محمّد عدد خلقك، وزنة عرشك، ومداد كلماتك ',
'اللهم صلّ، وسلّم، وأزد، وأنعم، وبارك على المصطفى سيّدنا محمّد.',
'اللهم صلّ على المبعوث رحمةً للعالمين',
'اللهم صلّ علي النبي صلاةً تمحو بها الخطايا، وتغفر بها الذنوب',
'اللهم صلّ على محمّد صلاةً كاملة شاملةً، تشفي بها صدورنا، وتُحقّق بها أمنياتنا.',
'اللهم صلّ على من أرسلته رحمةً للعالمين.',
'اللهم صلّ على النبي صلاةً كاملةً دائمةً، لا تنقطع أبدًا.',
'اللهم صلّ على شفيعنا، وحبيبنا، ونور أفئدتنا، وشفاء صدورنا سيدنا محمّد.',
'اللهم صلّ على النبي الهادي البشير.',
'اللهم صلّ على من يسقنا من يده يوم القيامة شربةً هنيئةً، لا نظمأ بعدها أبدًا.',
'اللهم صلّ على المصطفى الذي اصطفيته، ليكون خاتمًا للأنبياء والمرسلين.',
'اللَّهمَّ صَلِّ عَلَى محَمَّدٍ وَأَنْزِلْه الْمَنْزِلَ الْمقَرَّبَ مِنْكَ يَوْمَ الْقِيَامَة.',
'اللَّهمَّ صَلِّ عَلَى محَمَّدٍ وَعَلَى آلِ محَمَّد في الأَوَّلِينَ وَالآخِرِينَ، وَفِي الْمَلأِ الأَعْلَى إِلَى يَوْمِ الْدِّينِ.',
'اللهم صل على محمد عدد الرمل والحصى، في مستقر الأرضين شرقها وغربها وسهلها وجبالها، من يوم خلقت الدنيا إلى يوم القيامة، في كل يوم ألف مرة.',
'اللهم صل وسلم على سيدنا محمد صلاة تهب لنا بها أكمل المراد وفوق المراد، في دار الدنيا ودار المعاد، وعلى آلة وصحبه وبارك وسلم عدد ما علمت وزنة ما علمت وملء ما علمت.',
'اللهم صل على سيدنا محمد صلاة تنجينا بها من جميع الأهوال والآفات، وتقضي بها جميع الحاجات.',
'اللهم صلّ صلاة كاملة وسلّم سلاماً تاماً على سيدنا محمد النبي الأميّ الذي تنحل به العقد، وتنفرج به الكرب.',
   ]
   while not await asyncio.sleep(1200):
     for i in chat:
       try:
         await app.send_message(i, random.choice(salah))
       except:
         pass
    
     
asyncio.create_task(azkar())
